app/controllers/products_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 338]]
---
  def data
    @product = Product.find(params[:id])